# просто пустой класс :)
class void:
    pass

# Константы
class const:
    # Список горячих клавиш для блокировки
    BLOCK_HOTKEY_LIST = ["alt","ctrl","shift","esc","win","alt"and"F4"]
    # Список ответов "нет"
    ANSW_NO_LIST = ["нет","no"]
    # Список ответов "да"
    ANSW_YES_LIST = ["да","yes"]

    # ярик лох ебаный

    # Стартовый фон
    START_BACKGROUND = """

    ╔════════════════════════════════════════════════════════╗
    ║                                                        ║
    ║      ███████╗███╗   ██╗ █████╗ ██╗  ██╗███████╗        ║
    ║      ██╔════╝████╗  ██║██╔══██╗██║ ██╔╝██╔════╝        ║
    ║       █████═╗██╔██╗ ██║███████║█████╔╝ █████╗          ║
    ║           ██║██║╚██╗██║██╔══██║██╔═██╗ ██╔══╝          ║
    ║      ███████║██║ ╚████║██║  ██║██║  ██╗███████╗        ║
    ║      ╚══════╝╚═╝  ╚══╝╚═╝╚══╚═╝╚═╝  ╚═╝╚══════╝        ║
    ║                                                        ║
    ║          ██████╗  █████╗ ███╗   ███╗███████╗           ║
    ║         ██╔════╝ ██╔══██╗████╗ ████║██╔════╝           ║
    ║         ██║  ███╗███████║██╔████╔██║█████╗             ║
    ║         ██║   ██║██╔══██║██║╚██╔╝██║██╔══╝             ║
    ║         ╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗           ║
    ║          ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝           ║
    ║                                                        ║
    ╚════════════════════════════════════════════════════════╝

    """


class var:
    lock_keyboard_status = True
    lock_mouse_status = True